---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.AllowLargeGeometry.Prompt
enum: Autodesk.Revit.DB.Analysis.AllowLargeGeometry
zh: 提示、弹窗、消息框
source: html/4b5a3532-d4f3-4cc3-ca7f-d75cb3ba719f.htm
---
# Autodesk.Revit.DB.Analysis.AllowLargeGeometry.Prompt

**中文**: 提示、弹窗、消息框

Prompt in the UI. If no UI is present, default will be DisAllow.